УТ.РасширениеКонтурЛогистика/src/Enums/КонтурЛогистика_ТипыПодписи/КонтурЛогистика_ТипыПодписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыПодписи</name>
  <enumValues>
    <name>УКЭП</name>
  </enumValues>
  <enumValues>
    <name>ПЭП</name>
  </enumValues>
  <enumValues>
    <name>УНЭП</name>
  </enumValues>
  <enumValues>
    <name>Тестовая</name>
  </enumValues>
</mdclass:Enum>

УТ.РасширениеКонтурЛогистика/src/Enums/КонтурЛогистика_ТипыПодписи/ManagerModule.bsl
Функция ЗначениеДляXDTO(Ссылка) Экспорт
	
	Если Ссылка= УКЭП Тогда 
		Результат = "1";
	ИначеЕсли Ссылка= ПЭП Тогда 
		Результат = "2";
	ИначеЕсли Ссылка= УНЭП Тогда 
		Результат = "3";
	Иначе
		
		ВызватьИсключение "Для заполнения в xml передано неверное значение Типа подписи: " + Ссылка;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеИзXDTO(Строка) Экспорт
	
	Если Строка= "1" Тогда 
		Результат = УКЭП;
	ИначеЕсли Строка= "2" Тогда 
		Результат = ПЭП;
	ИначеЕсли Строка= "3" Тогда 
		Результат = УНЭП;
	Иначе
		
		Результат = ПустаяСсылка();
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
